content/assignments/week7.md
+++
title = "Week 7 - Incorporation, Identification, & ‘Mesh' Theories of Rationality"
publishDate = 2020-09-29T00:00:00-04:00
tags = ["action", "agency", "compatibilism", "identification", "incorporation"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

This week we continue our discussion of Kantian compatibilist theories of
rationality. We'll look at Harry Frankfurt's influential non-causalist conception of
intentional action, along with his related conception of the "identification" of an
agent with its actions. We'll compare it to Henry Allison's influential idea that
Kant considers rational action to involve "incorporation" of a desire or impulse as
one's reason.

-   [Handout](/materials/handouts/7-kant-compatibilism-persons.pdf) for week 7


## Readings {#readings}

-   Kant
    -   _[Religion Within the Boundaries of Reason Alone](/materials/readings/kant-incorporation.pdf)_ (excerpt): 6:22-26
        -   This is where Kant articulates what Henry Allison calls the "Incorporation
            Thesis"---i.e. the claim that a desire or impulse constitutes a reason for
            action only insofar as it has been incorporated by the subject into its maxim
            of action
        -   Allison, _[Kant's Theory of Freedom](/materials/readings/allison-incorporation.pdf)_ (excerpt, see especially pp. 39-40 on incorporation)
-   Frankfurt
    -   "[Freedom of the Will and the Concept of a Person](/materials/readings/frankfurt-freedom.pdf)"
    -   "[Identification & Wholeheartedness](/materials/readings/frankfurt-identification.pdf)"
-   Other Readings (Optional)
    -   Velleman, "[Identification & Identity](/materials/readings/velleman-identification.pdf)" (with a reply by Frankfurt)
    -   Bratman, "[Planning Agency, Autonomous Agency](/materials/readings/bratman-agency.pdf)"
    -   Korsgaard, "[The Authority of Reflection](/materials/readings/korsgaard-reflection.pdf)" (excerpt)
    -   Schapiro, "[Foregrounding Desire: A Defense of Kant’s Incorporation Thesis](/materials/readings/schapiro-incorporation.pdf)"
